<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Seeder;

class ServiceSeeder extends Seeder
{
    protected $allServices = [
        'Пісок щільний природний ...' => [
            'Зерновий склад і модуль крупності',
            'Вміст глини у грудках',
            'Вміст пиловидних та глинистих часток',
            'Насипна густина',
            'Вологість',
        ],
        'Пісок з відсівів дроблення вивержених гірських порід' => [
            'Зерновий склад і модуль крупності',
            'Вміст пиловидних та глинистих часток',
            'Вміст глину у грудках',
            'Насипна густина',
            'Міцність',
            'Вміст зерен сторонніх гірських порід та сторонніх домішок',
            'Ефективна сумарна питома активність природних радіонуклідів',
        ],
        'Грунти' => [
            'Вологість',
            'Густина',
            'Зерновий склад',
        ],
        'Гравій, щебінь і пісок штучні пористі' => [
            'Зерновий  склад',
            'Вміст глини у грудках',
            'Вміст у піску пиловидних та глинистих часток',
        ],
        'Щебінь, гравій та щебенево-піщана суміш' => [
            'Вміст зерен слабких порід у щебені (гравії) таслабких різновидів у гірській породі',
            'Стиранність у полочному барабані',
            'Опір удару на копрі ПМ',
            'Морозостійкість',
            'Електроізоляційні властивості щебеню для баластного шару залізничної колії',
        ],
        'Щебінь та гравій із природного каменю' => [
            'Зерновий склад',
            'Вміст подрібнених зерен у щебені з гравію',
            'Вміст пиловидних та глинистих часток',
            'Вміст глини у грудках',
            'Вміст зерен пластинчастої (лещадної) та голчастої форми',
            'Дробильність',
            'Вміст зерен слабких порід у щебені (гравії) та слабких різновидів у гірській породі',
            'Морозостійкість',
            'Насипна щільність та пустотність',
        ],
        'Бетони' => [
            'Морозостійкість',
        ],
        'Розчини' => [
            'Міцність бетону на стиск по контрольним зразкам',
        ],
        'Будівельних матеріалів ...' => [
            'Ефективна сумарна питома активність природних радіонуклідів',
            'Середня густина',
            'Вологість',
            'Водопоглинання',
            'Водонепроникність',
            'Стираність',
            'Міцність бетону безруйнівним методом',
        ],
        'Вироби бетонні стінові дрібноштучні' => [
            'Морозостійкість',
            'Геометричні параметри і зовнішній вигляд',
            'Границя міцності при стиску',
            'Середня щільність',
            'Вологість',
            'Водопоглинання',
        ],
        'Цегла та камені керамічні' => [
            'Маса',
            'Водопоглинання',
            'Середня густина',
            'Морозостійкість',
            'Наявність вапняних включень',
            'Границя міцності на стиск та згин',
            'Форма, розміри і зовнішній вигляд',
            'Ефективна сумарна питома активність природних радіонуклідів',
        ],
        'Цегла та камені силікатні' => [
            'Маса',
            'Водопоглинання',
            'Середня густина',
            'Морозостійкість',
            'Дефекти від силікатної суміші, що не погасилася',
            'Кількість та розмір включень',
            'Міцність зчеплення декоративного покриття з поверхнею виробів',
            'Границя міцності на стиск та згин',
            'Форма, розміри і зовнішній вигляд',
        ],
        'Пиломатеріали' => [
            'Геометричні розміри, зовнішній вигляд',
            'Вологість',
            'Шорсткість',
            'Вади деревини',
        ],
        'Плити пінополістирольні' => [
            'Густина',
            'Вологість',
            'Водопоглинання',
            'Час самостійного горіння',
            'Геометричні розміри',
        ],
        'Плитки керамічні' => [
            'Визначення розмірів та якості поверхні',
            'Границя міцності при згині',
            'Термічна стійкість глазурі',
            'Визначення зносостійкості неглазурованої плитки',
            'Морозостійкість',
        ],
        'Плити бетонні фасадні' => [
            'Міцність бетону по контрольним зразкам',
            'Геометричні параметри, зовнішній  вигляд',
            'Водонепроникність',
            'Середня густина',
            'Водопоглинення',
            'Морозостійкість',
            'Маса',
        ],
        'Вироби бетонні тротуарні' => [
            'Товщина захисного шару',
            'Морозостійкість',
            'Міцність бетону на стиск',
            'Міцність зварних з\'єднань',
            'Водопоглинання',
            'Стираність',
            'Міцність бетону неруйнівним методом',
            'Геометричні розміри',
        ],
        'Залізобетонні вироби' => [
            'Товщина захисного шару бетону',
            'Морозостійкість',
            'Міцність бетону по контрольним зразкам',
            'Міцність зварних з\'єднань',
            'Середня густина',
            'Водонепроникність',
            'Міцність бетону неруйнівним методом',
            'Якість сіток арматурних зварних',
            'Геометричні параметри, зовнішній вигляд',
        ],
        'Камені бетонні та залізобетонні бортові' => [
            'Товщина захисного шару бетону',
            'Морозостійкість',
            'Міцність бетону по контрольним зразкам',
            'Міцність, тріщиностійкість',
            'Міцність бетону неруйнівним методом',
            'Середня густина',
            'Водопоглинання',
            'Геометричні параметри, зовнішній вигляд',
        ],
        'Суміші асфальтобетонні і асфальтобетон дорожний' => [
            'Зовнішній вигляд',
            'Середня густина ущільненого матеріалу',
            'Границя міцності при стисканні',
        ],
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach ($this->allServices as $material => $characteristics) {
            $service = Service::create([
                'parent_id' => 0,
                'name' => $material,
            ]);

            foreach ($characteristics as $characteristic) {
                Service::create([
                    'parent_id' => $service->id,
                    'name' => $characteristic,
                ]);
            }
        }
    }
}
